In [2]:
import numpy as np
import pandas as pd
import seaborn as sns

In [3]:
df = sns.load_dataset("iris")
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [4]:
df.groupby("species")[["petal_width"]].sum()

            petal_width
species
setosa             12.3
versicolor         66.3
virginica         101.3

In [5]:
d = {'batch': ['A','B','C','A','B','C'], 'var1':[10,23,33,22,11,99],'var2':[100,253,333,262,111,969]}
df = pd.DataFrame(data=d)
df

  batch  var1  var2
0     A    10   100
1     B    23   253
2     C    33   333
3     A    22   262
4     B    11   111
5     C    99   969

In [6]:
df.groupby('batch').aggregate([np.min,np.median,np.max])

/tmp/ipykernel_19098/786768124.py:1: FutureWarning: The provided callable <function min at 0x7f948a9b8ae0> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  df.groupby('batch').aggregate([np.min,np.median,np.max])
/tmp/ipykernel_19098/786768124.py:1: FutureWarning: The provided callable <function median at 0x7f94893ca7a0> is currently using SeriesGroupBy.median. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "median" instead.
  df.groupby('batch').aggregate([np.min,np.median,np.max])
/tmp/ipykernel_19098/786768124.py:1: FutureWarning: The provided callable <function max at 0x7f948a9b89a0> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  df.groupby('batch').aggregate([np.min,np.median,np.max])
/tmp/ipykernel_19098/786768124.py:1: FutureWarning: The provided callable <function min at 0x7f948a9b8ae0> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  df.groupby('batch').aggregate([np.min,np.median,np.max])

      var1            var2
       min median max  min median  max
batch
A       10   16.0  22  100  181.0  262
B       11   17.0  23  111  182.0  253
C       33   66.0  99  333  651.0  969

In [7]:
df.groupby('batch').transform(lambda x: x.mean())

   var1   var2
0  16.0  181.0
1  17.0  182.0
2  66.0  651.0
3  16.0  181.0
4  17.0  182.0
5  66.0  651.0

In [8]:
df.groupby("batch").filter(lambda x: x["var1"].mean()<17)

  batch  var1  var2
0     A    10   100
3     A    22   262

In [12]:
df[['var1','var2']].apply(np.sum)

var1     198
var2    2028
dtype: int64

In [21]:
df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [22]:
df.pivot_table(values='age',index='sex',columns='class')

class       First     Second      Third
sex
female  34.611765  28.722973  21.750000
male    41.281386  30.740707  26.507589

In [24]:
d={"A":["foo","foo","foo","bar","bar","bar"],
    "B":["one","one","two","two","one","one"],
    "C":["x","y","x","y","x","y"],
    "D":[1,3,2,5,4,1]}
new_df = pd.DataFrame(d)
new_df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [31]:
new_df.groupby(["A","B","C"])[["D"]].aggregate("mean")

             D
A   B   C
bar one x  4.0
        y  1.0
    two y  5.0
foo one x  1.0
        y  3.0
    two x  2.0

In [29]:
new_df.groupby(["A","B","C"])[["D"]].aggregate("mean").stack()

A    B    C
bar  one  x  D    4.0
          y  D    1.0
     two  y  D    5.0
foo  one  x  D    1.0
          y  D    3.0
     two  x  D    2.0
dtype: float64

In [30]:
new_df.groupby(["A","B","C"])[["D"]].aggregate("mean").unstack()

           D
C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [35]:
new_df.groupby(["A","B","C"])[["D"]].aggregate("mean").unstack().unstack()

       D
C      x         y
B    one  two  one  two
A
bar  4.0  NaN  1.0  5.0
foo  1.0  2.0  3.0  NaN

In [38]:
d = {"var1":[1,2,3,4,5],
     "var2":[111,222,333,444,555]}
df = pd.DataFrame(d)
df

   var1  var2
0     1   111
1     2   222
2     3   333
3     4   444
4     5   555

In [41]:
df[["var1"]].mean()

var1    3.0
dtype: float64

In [42]:
df.apply(np.mean)

var1      3.0
var2    333.0
dtype: float64

In [44]:
df.map(lambda x:x*5)

   var1  var2
0     5   555
1    10  1110
2    15  1665
3    20  2220
4    25  2775

In [46]:
df.var1.map({1:"Z",3:"A"})

0      Z
1    NaN
2      A
3    NaN
4    NaN
Name: var1, dtype: object

In [48]:
df.isnull().sum()

var1    0
var2    0
dtype: int64

In [53]:
df = sns.load_dataset("diamonds")
df = df.select_dtypes(include=["float64", "int64"])
df = df.dropna()
df

       carat  depth  table  price     x     y     z
0       0.23   61.5   55.0    326  3.95  3.98  2.43
1       0.21   59.8   61.0    326  3.89  3.84  2.31
2       0.23   56.9   65.0    327  4.05  4.07  2.31
3       0.29   62.4   58.0    334  4.20  4.23  2.63
4       0.31   63.3   58.0    335  4.34  4.35  2.75
...      ...    ...    ...    ...   ...   ...   ...
53935   0.72   60.8   57.0   2757  5.75  5.76  3.50
53936   0.72   63.1   55.0   2757  5.69  5.75  3.61
53937   0.70   62.8   60.0   2757  5.66  5.68  3.56
53938   0.86   61.0   58.0   2757  6.15  6.12  3.74
53939   0.75   62.2   55.0   2757  5.83  5.87  3.64

[53940 rows x 7 columns]

In [50]:
df.isnull().sum()

carat    0
depth    0
table    0
price    0
x        0
y        0
z        0
dtype: int64

In [54]:
df_table = df.table
df_table

0        55.0
1        61.0
2        65.0
3        58.0
4        58.0
         ...
53935    57.0
53936    55.0
53937    60.0
53938    58.0
53939    55.0
Name: table, Length: 53940, dtype: float64

In [4]:
import pandas as pd

# Sample DataFrame
data = {'A': [1, 2, 3],
        'B': [4, 5, 6],
        'C': [7, 8, 9]}
df = pd.DataFrame(data)

In [5]:
df

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [7]:
df['A'][0]

1